"- General appearance/Attitude/Behavior : Downward, averted gaze and poor eye contact, Decreased general activity. Appears her stated age, casually dressed but somewhat disheveled, with mildly neglected grooming (“I just don’t have the energy to care how I look anymore”). Sits slumped in the chair, hands clasped tightly in her lap, with occasional wringing of fingers. Remains cooperative and polite throughout the interview, answers questions quietly and sincerely, with no psychomotor agitation or abnormal involuntary movements observed.\n\n- Mood : Depressed “I feel empty and exhausted all the time, like I’m just going through the motions.”\n\n- Affect : Restricted, Blunt, Anxious. Affect is constricted with low reactivity; becomes tearful when describing guilt about her children, and appears tense when discussing work (“My chest tightens whenever I think about going to the office”).\n\n- Spontaneity : (-) Spontaneous speech and initiative are reduced; she answers questions when prompted but rarely initiates new topics (“I don’t really know what to say unless you ask me”).\n\n- Verbal productivity : Decreased\n\n- Tone of voice : low-pitched\n\n- Social judgement : Normal. She demonstrates appropriate understanding of social norms and consequences (“I know my kids would be devastated if I really disappeared, and my husband would be overwhelmed alone”).\n\n- Insight : Slight awareness of being sick and needing help, but denying it at the same time. “I know something is wrong and that’s why I came, but maybe I’m just weak or overreacting. Other people handle this without going to the hospital.”\n\n- Reliability : Yes. She appears sincere and consistent in her reports, acknowledges her overdose and current suicidal thoughts without obvious distortion (“I took the pills hoping I wouldn’t wake up, but I told my sister because I got scared afterward”).\n\n- Perception : Normal. She denies hallucinations or other perceptual disturbances (“I don’t see or hear things that aren’t there; it’s just my thoughts that won’t stop”).\n\n- Thought process : Normal. Thoughts are logical, coherent, and goal-directed, though slowed; no loosening of associations or formal thought disorder detected.\n\n- Thought content : Preoccupation, Rumination. Marked preoccupation with worthlessness, guilt, and suicidal ideation (“My family would be better off without me”; “I keep going over every mistake at work in my head again and again, especially at night”; “Sometimes I think it would be better if I just disappeared”). No delusions, ideas of reference, or grandiosity elicited."