"- General appearance/Attitude/Behavior : A 25-year-old Korean male, casually but neatly dressed in office attire, appearing his stated age with adequate nutrition and good hygiene. Hair and clothes were clean and orderly, consistent with his reported concern for cleanliness. He sat slightly forward in the chair, hands often clasped together or rubbing his fingers, and intermittently glanced at the door and windows. Eye contact was generally appropriate but occasionally fleeting when discussing his symptoms. He was polite and cooperative throughout the interview, frequently saying “\"Is it okay if I explain in detail?\"” and “\"Sorry, I tend to check things again\"” when clarifying answers. No psychomotor agitation or retardation was observed; no abnormal involuntary movements, tremor, or gait disturbance were noted.\n\n- Mood : Dysphoric \"“These days I just feel constantly on edge and tired because I can’t stop checking things.”\"\n\n- Affect : Anxious, Tense, Restricted (somewhat constricted range, predominantly anxious and worried). When describing his morning routine, he appeared visibly tense and said, “\"My chest feels tight when I try to leave the house without checking one more time.\"”\n\n- Spontaneity : (+) He initiated relevant details about his symptoms without excessive prompting, e.g., “\"Actually, it started getting worse after I moved out on my own,\"” and asked appropriate questions about treatment.\n\n- Verbal productivity : Moderate. He spoke in a normal rate and amount, giving detailed descriptions of his checking rituals such as, “\"I touch the door lock three times, then take a photo to be sure, but even then I don’t feel completely safe.\"”\n\n- Tone of voice : Moderate-pitched, slightly low and subdued when describing his worries: “\"I know it sounds irrational, but I keep thinking my apartment will burn down if I don’t check properly.\"”\n\n- Social judgement : Normal. He demonstrated appropriate understanding of social norms and consequences, saying, “\"I know being late all the time is unacceptable at work, and I’m worried my colleagues think I’m irresponsible.\"”\n\n- Insight : Intellectual insight. He clearly recognized his symptoms as excessive and irrational, stating, “\"Logically I know the door is locked, but my brain keeps telling me, ‘What if you missed it?’\"” and “\"I think this is some kind of illness, like my aunt’s OCD, and I need help to control it.\"” He understood the link between his symptoms and occupational/functional impairment.\n\n- Reliability : Yes\n\n- Perception : Normal\n\n- Thought process : Normal. Thought flow was logical, coherent, and goal-directed. He was able to give a chronological account of his symptom progression, e.g., “\"First I only checked once or twice, then I started taking photos, and now sometimes I go back from the bus stop.\"” No loose associations, flight of ideas, or tangentiality were noted.\n\n- Thought content : Obsession, Compulsion. He reported recurrent intrusive thoughts and images such as, “\"I suddenly picture my apartment on fire because I left the gas on,\"” and “\"I keep thinking, ‘What if someone breaks in because I didn’t lock the door properly?’ even though I just checked.\"” He described accompanying checking rituals: “\"Before leaving, I touch the lock in a certain order and repeat it until it feels right,\"” “\"I avoid using the gas on weekdays so I don’t have to spend 20–30 minutes checking it,\"” and “\"Sometimes I walk back from the bus stop just to check the door one more time.\"”"